belan581/smart_sensors_workshop/getdata/sdkconfig.defaults
# sdkconfig.defaults — Configuración para captura de datos MPU6050 @ 1 KHz

# ─── Target ────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ─── FreeRTOS a 1000 Hz para vTaskDelayUntil con período de 1 ms ──
CONFIG_FREERTOS_HZ=1000

# ─── Stack de la tarea principal ──────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ─── Logging ──────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ─── Flash ────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# ─── Deshabilitar WiFi/BT para reducir overhead ───────────────
CONFIG_BT_ENABLED=n
